<a href="https://colab.research.google.com/github/RuthNduta/World-Suicide-Rates-in-SQ/blob/main/World_Suicide_Rate_Analysis_with_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **SQL DATA CLEANING, OUTLIERS AND ANALYTICS**

# **1. Connecting to our Database**

In [2]:
#loading the sql extension into our environment
%load_ext sql

# Then connect to our in memory sqlite database
 
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @None'

# **2. Importing Data from CSV files**

The dataset we will use contains suicide cases from different countries in the world with different generations, age groups and other factors as outlined below.

In [3]:
# Importing the pandas library
# We will use a function read_csv from pandas to read our datasets as shown
#
import pandas as pd

In [4]:
# Loading our table from the respective CSV files 
with open('/content/Suicide.csv','r') as f:
    Suicide = pd.read_csv(f, index_col=0, encoding='utf-8')
%sql DROP TABLE if EXISTS Suicide
%sql PERSIST Suicide;
%sql SELECT * FROM Suicide LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, 'Albania', 1987.0, 'male', '15-24 years', 21.0, 312900.0, 6.71, 2156624900.0, 796.0, 'Generation X', 0.006711409395973153),
 (1, 'Albania', 1987.0, 'male', '35-54 years', 16.0, 308000.0, 5.19, 2156624900.0, 796.0, 'Silent', 0.005194805194805196),
 (2, 'Albania', 1987.0, 'female', '15-24 years', 14.0, 289700.0, 4.83, 2156624900.0, 796.0, 'Generation X', 0.004832585433206766),
 (3, 'Albania', 1987.0, 'male', '75+ years', 1.0, 21800.0, 4.59, 2156624900.0, 796.0, 'G.I. Generation', 0.004587155963302753),
 (4, 'Albania', 1987.0, 'male', '25-34 years', 9.0, 274300.0, 3.28, 2156624900.0, 796.0, 'Boomers', 0.0032810791104629965)]

# **3. Analytics**

In [15]:
#1. identifying top 5 countries with the highest suicide cases in the world
%%sql

SELECT Country, SUM (Suicides_no) AS[Total Suicides]
FROM Suicide 
GROUP BY Country
ORDER BY SUM (Suicides_no) DESC LIMIT 5;

 * sqlite://
Done.

[('Bulgaria', 29527.0),
 ('Chile', 27581.0),
 ('Colombia', 27149.0),
 ('Argentina', 26775.0),
 ('Cuba', 24092.0)]

In [16]:
#2. identifying top 5 countries with the lowest suicide cases in the world
%%sql

SELECT Country, SUM (Suicides_no) AS[Total Suicides]
FROM Suicide 
GROUP BY Country
ORDER BY SUM (Suicides_no) ASC LIMIT 5;

 * sqlite://
Done.

[('Dominica', 0.0),
 ('Antigua and Barbuda', 11.0),
 ('Grenada', 38.0),
 ('Cabo Verde', 42.0),
 ('Bahamas', 93.0)]

In [17]:
#3. identifying the generation with the highest suicide cases
%%sql

SELECT Generation, SUM (Suicide_rate) AS[Total Suicides]
FROM Suicide 
GROUP BY Generation
ORDER BY SUM (Suicide_rate) DESC LIMIT 5;

 * sqlite://
Done.

[('Silent', 23.892111671910023),
 ('G.I. Generation', 19.831629970058355),
 ('Generation X', 14.177934550694312),
 ('Boomers', 12.234694338773634),
 ('Millenials', 6.17611734874485)]

In [18]:
#4. identifying the generations with the lowest suicide cases
%%sql

SELECT Generation, SUM (Suicide_rate) AS[Total Suicides]
FROM Suicide 
GROUP BY Generation
ORDER BY SUM (Suicide_rate) ASC LIMIT 5;

 * sqlite://
Done.

[('Generation Z', 0.20553024000182),
 ('Millenials', 6.17611734874485),
 ('Boomers', 12.234694338773634),
 ('Generation X', 14.177934550694312),
 ('G.I. Generation', 19.831629970058355)]

In [20]:
#5 Investigating which gender has more suicide rates compared to the other one
%%sql

SELECT Sex, SUM (Suicides_no) AS[Total Suicides]
FROM Suicide 
GROUP BY Sex
ORDER BY SUM (Suicides_no) DESC;

 * sqlite://
Done.

[('male', 217574.0), ('female', 138845.0)]

In [23]:
#6. Knowing the age group which most people commit suicide
%%sql

SELECT Age, SUM (Suicides_no) AS[Total Suicides]
FROM Suicide 
GROUP BY Age
ORDER BY SUM (Suicide_rate) DESC

 * sqlite://
Done.

[('75+ years', 57323.0),
 ('55-74 years', 76860.0),
 ('25-34 years', 70517.0),
 ('35-54 years', 75472.0),
 ('15-24 years', 68796.0),
 ('5-14 years', 7451.0)]

In [27]:
#7. Finding out the year where people committed suicide the most
%%sql

SELECT Year, SUM (Suicides_no) AS[Total Suicides]
FROM Suicide 
GROUP BY Year
ORDER BY SUM (Suicides_no) DESC

 * sqlite://
Done.

[(1995.0, 16622.0),
 (1996.0, 15538.0),
 (2001.0, 15247.0),
 (1998.0, 15128.0),
 (1999.0, 14937.0),
 (1997.0, 14745.0),
 (2002.0, 14680.0),
 (2003.0, 13893.0),
 (2000.0, 13834.0),
 (1992.0, 13697.0),
 (1993.0, 13488.0),
 (1994.0, 13208.0),
 (1991.0, 11959.0),
 (1990.0, 11689.0),
 (2004.0, 11195.0),
 (1988.0, 10399.0),
 (1987.0, 10398.0),
 (2005.0, 10276.0),
 (1985.0, 10215.0),
 (1986.0, 10123.0),
 (2008.0, 9786.0),
 (2007.0, 9562.0),
 (2009.0, 9400.0),
 (1989.0, 9221.0),
 (2006.0, 9127.0),
 (2014.0, 8491.0),
 (2010.0, 8482.0),
 (2013.0, 8200.0),
 (2011.0, 7747.0),
 (2012.0, 7627.0),
 (2015.0, 6106.0),
 (2016.0, 1399.0)]

In [28]:
#8. Finding which countries has the most suicides comited at every 100,000
%%sql

SELECT Country, 
SUM (Suicides_per_hundred_thousand_pop) 
FROM Suicide 
GROUP BY Country
ORDER BY SUM (Suicides_per_hundred_thousand_pop) DESC
limit 5;

 * sqlite://
Done.

[('Estonia', 6873.780000000001),
 ('Bulgaria', 6259.830000000009),
 ('Croatia', 5982.84),
 ('Austria', 4927.680000000001),
 ('Cuba', 4591.8600000000015)]

In [29]:
#9. Finding which countries has the leas suicides committed at every 100,000
%%sql

SELECT Country, 
SUM (Suicides_per_hundred_thousand_pop) 
FROM Suicide 
GROUP BY Country
ORDER BY SUM (Suicides_per_hundred_thousand_pop) ASC
limit 7;

 * sqlite://
Done.

[('Dominica', 0.0),
 ('Bosnia and Herzegovina', 110.81),
 ('Cabo Verde', 133.84),
 ('Canada', 136.57999999999998),
 ('Brazil', 144.85999999999999),
 ('Antigua and Barbuda', 179.14),
 ('Bahamas', 344.28000000000003)]

In [30]:
#10. Finding which Age groups has the most suicides commited at every 100,000
%%sql

SELECT Age, 
SUM (Suicides_per_hundred_thousand_pop) 
FROM Suicide 
GROUP BY Age
ORDER BY SUM (Suicides_per_hundred_thousand_pop) DESC
limit 5;

 * sqlite://
Done.

[('75+ years', 30884.559999999987),
 ('55-74 years', 13241.269999999991),
 ('25-34 years', 11979.960000000001),
 ('35-54 years', 9932.399999999965),
 ('15-24 years', 9738.529999999986)]